Importando Bibliotecas

In [47]:
import pandas as pd
import numpy as np

Construindo um DataFrame

In [48]:
df = pd.DataFrame(
    np.random.randn(9, 4)*100,
    index=["A", "B", "C", "D", "E", "F", "G", "H", "I"],
    columns=["coluna1", "coluna2", "coluna3","coluna4"],
)
df

      coluna1     coluna2     coluna3     coluna4
A -200.954785  -35.593491   43.168450   97.885861
B   83.213024   15.859095  -13.372720   44.755455
C  -24.802360  -38.218990  110.833376 -207.351451
D -179.896578 -155.874117   21.453083  -57.353994
E -100.306700 -104.257995   87.273293  -31.723929
F  118.331541  205.920072 -172.536176   42.629369
G   23.521763  -96.289179   38.880163 -187.618320
H  103.844732  -27.627483 -110.210025 -158.827858
I  -34.684996   80.496935  120.378293  -90.105892

In [49]:
df.dtypes

coluna1    float64
coluna2    float64
coluna3    float64
coluna4    float64
dtype: object

Alterando os Tipos de Dados

In [50]:
df['coluna1'] = df['coluna1'].astype(int)

In [51]:
df.dtypes

coluna1      int32
coluna2    float64
coluna3    float64
coluna4    float64
dtype: object

In [52]:
df['coluna3'] = df['coluna3'].astype(str)

In [53]:
df.dtypes

coluna1      int32
coluna2    float64
coluna3     object
coluna4    float64
dtype: object

In [54]:
df

   coluna1     coluna2              coluna3     coluna4
A     -200  -35.593491    43.16845002860258   97.885861
B       83   15.859095  -13.372720444388012   44.755455
C      -24  -38.218990   110.83337637106989 -207.351451
D     -179 -155.874117   21.453082651064918  -57.353994
E     -100 -104.257995    87.27329323854346  -31.723929
F      118  205.920072   -172.5361764516966   42.629369
G       23  -96.289179   38.880162634494795 -187.618320
H      103  -27.627483  -110.21002532504967 -158.827858
I      -34   80.496935   120.37829301118248  -90.105892

Acrescentado Dados Faltantes na Tabela

In [55]:
df.iloc[4,2]

'87.27329323854346'

In [56]:
df.iloc[4,2] = np.nan

In [57]:
df

   coluna1     coluna2              coluna3     coluna4
A     -200  -35.593491    43.16845002860258   97.885861
B       83   15.859095  -13.372720444388012   44.755455
C      -24  -38.218990   110.83337637106989 -207.351451
D     -179 -155.874117   21.453082651064918  -57.353994
E     -100 -104.257995                  NaN  -31.723929
F      118  205.920072   -172.5361764516966   42.629369
G       23  -96.289179   38.880162634494795 -187.618320
H      103  -27.627483  -110.21002532504967 -158.827858
I      -34   80.496935   120.37829301118248  -90.105892

In [59]:
df.iloc[1,0] = np.nan
df.iloc[4,0] = np.nan
df.iloc[3,0] = np.nan
df.iloc[8,0] = np.nan
df.iloc[6,2] = np.nan
df.iloc[8,3] = np.nan

In [60]:
df

   coluna1     coluna2              coluna3     coluna4
A   -200.0  -35.593491    43.16845002860258   97.885861
B      NaN   15.859095  -13.372720444388012   44.755455
C    -24.0  -38.218990   110.83337637106989 -207.351451
D      NaN -155.874117   21.453082651064918  -57.353994
E      NaN -104.257995                  NaN  -31.723929
F    118.0  205.920072   -172.5361764516966   42.629369
G     23.0  -96.289179                  NaN -187.618320
H    103.0  -27.627483  -110.21002532504967 -158.827858
I      NaN   80.496935   120.37829301118248         NaN

In [61]:
df.dtypes

coluna1    float64
coluna2    float64
coluna3     object
coluna4    float64
dtype: object

Identificando Dados Faltantes

In [63]:
df

   coluna1     coluna2              coluna3     coluna4
A   -200.0  -35.593491    43.16845002860258   97.885861
B      NaN   15.859095  -13.372720444388012   44.755455
C    -24.0  -38.218990   110.83337637106989 -207.351451
D      NaN -155.874117   21.453082651064918  -57.353994
E      NaN -104.257995                  NaN  -31.723929
F    118.0  205.920072   -172.5361764516966   42.629369
G     23.0  -96.289179                  NaN -187.618320
H    103.0  -27.627483  -110.21002532504967 -158.827858
I      NaN   80.496935   120.37829301118248         NaN

In [62]:
df.isna()

   coluna1  coluna2  coluna3  coluna4
A    False    False    False    False
B     True    False    False    False
C    False    False    False    False
D     True    False    False    False
E     True    False     True    False
F    False    False    False    False
G    False    False     True    False
H    False    False    False    False
I     True    False    False     True

In [64]:
df.isnull()

   coluna1  coluna2  coluna3  coluna4
A    False    False    False    False
B     True    False    False    False
C    False    False    False    False
D     True    False    False    False
E     True    False     True    False
F    False    False    False    False
G    False    False     True    False
H    False    False    False    False
I     True    False    False     True

In [65]:
df.coluna1.isna()

A    False
B     True
C    False
D     True
E     True
F    False
G    False
H    False
I     True
Name: coluna1, dtype: bool

In [66]:
df[df.coluna1.isna()]

   coluna1     coluna2              coluna3    coluna4
B      NaN   15.859095  -13.372720444388012  44.755455
D      NaN -155.874117   21.453082651064918 -57.353994
E      NaN -104.257995                  NaN -31.723929
I      NaN   80.496935   120.37829301118248        NaN

In [67]:
df[~df.coluna1.isna()]

   coluna1     coluna2              coluna3     coluna4
A   -200.0  -35.593491    43.16845002860258   97.885861
C    -24.0  -38.218990   110.83337637106989 -207.351451
F    118.0  205.920072   -172.5361764516966   42.629369
G     23.0  -96.289179                  NaN -187.618320
H    103.0  -27.627483  -110.21002532504967 -158.827858

In [69]:
df.coluna1.isna().sum()

4

In [70]:
df.isna().sum()

coluna1    4
coluna2    0
coluna3    2
coluna4    1
dtype: int64

In [71]:
df['coluna1']

A   -200.0
B      NaN
C    -24.0
D      NaN
E      NaN
F    118.0
G     23.0
H    103.0
I      NaN
Name: coluna1, dtype: float64

In [73]:
df['coluna2'].isna()

A    False
B    False
C    False
D    False
E    False
F    False
G    False
H    False
I    False
Name: coluna2, dtype: bool

In [74]:
df['coluna1'].isna().sum()

4

In [75]:
df["coluna2"].isna().sum()

0

In [77]:
df

   coluna1     coluna2              coluna3     coluna4
A   -200.0  -35.593491    43.16845002860258   97.885861
B      NaN   15.859095  -13.372720444388012   44.755455
C    -24.0  -38.218990   110.83337637106989 -207.351451
D      NaN -155.874117   21.453082651064918  -57.353994
E      NaN -104.257995                  NaN  -31.723929
F    118.0  205.920072   -172.5361764516966   42.629369
G     23.0  -96.289179                  NaN -187.618320
H    103.0  -27.627483  -110.21002532504967 -158.827858
I      NaN   80.496935   120.37829301118248         NaN

In [78]:
(df.isna().sum()/9)

coluna1    0.444444
coluna2    0.000000
coluna3    0.222222
coluna4    0.111111
dtype: float64

Tratamento de Dados Ausentes

In [79]:
df['coluna1']

A   -200.0
B      NaN
C    -24.0
D      NaN
E      NaN
F    118.0
G     23.0
H    103.0
I      NaN
Name: coluna1, dtype: float64

Substituindo por 0

In [80]:
df['coluna1'].fillna(0)

A   -200.0
B      0.0
C    -24.0
D      0.0
E      0.0
F    118.0
G     23.0
H    103.0
I      0.0
Name: coluna1, dtype: float64

In [81]:
df['coluna1']

A   -200.0
B      NaN
C    -24.0
D      NaN
E      NaN
F    118.0
G     23.0
H    103.0
I      NaN
Name: coluna1, dtype: float64

Substituindo pela Média

In [82]:
(118+23+103)/3

81.33333333333333

In [83]:
df['coluna1'].fillna(81)

A   -200.0
B     81.0
C    -24.0
D     81.0
E     81.0
F    118.0
G     23.0
H    103.0
I     81.0
Name: coluna1, dtype: float64

In [84]:
df['coluna1'].mean()

4.0

In [85]:
df['coluna1'].fillna(media)

A   -200.000000
B     66.333333
C    -24.000000
D     66.333333
E     66.333333
F    118.000000
G     23.000000
H    103.000000
I     66.333333
Name: coluna1, dtype: float64

Substituindo pela Mediana

In [86]:
df["coluna1"].sort_values()

A   -200.0
C    -24.0
G     23.0
H    103.0
F    118.0
B      NaN
D      NaN
E      NaN
I      NaN
Name: coluna1, dtype: float64

In [87]:
(23+103)/2

63.0

In [88]:
df["coluna1"].fillna(63)

A   -200.0
B     63.0
C    -24.0
D     63.0
E     63.0
F    118.0
G     23.0
H    103.0
I     63.0
Name: coluna1, dtype: float64

In [90]:
mediana = df['coluna1'].median()

In [91]:
df["coluna1"].fillna(mediana)

A   -200.0
B     23.0
C    -24.0
D     23.0
E     23.0
F    118.0
G     23.0
H    103.0
I     23.0
Name: coluna1, dtype: float64

Substituindo usando o FFILL e o BFILL

In [92]:
df["coluna1"]

A   -200.0
B      NaN
C    -24.0
D      NaN
E      NaN
F    118.0
G     23.0
H    103.0
I      NaN
Name: coluna1, dtype: float64

In [93]:
df["coluna1"].fillna(method='ffill')

A   -200.0
B   -200.0
C    -24.0
D    -24.0
E    -24.0
F    118.0
G     23.0
H    103.0
I    103.0
Name: coluna1, dtype: float64

In [94]:
df["coluna1"].fillna(method='bfill')

A   -200.0
B    -24.0
C    -24.0
D    118.0
E    118.0
F    118.0
G     23.0
H    103.0
I      NaN
Name: coluna1, dtype: float64

Dropando as Linhas com Missing

In [95]:
df['coluna1'].dropna()

A   -200.0
C    -24.0
F    118.0
G     23.0
H    103.0
Name: coluna1, dtype: float64

In [96]:
df.dropna()

   coluna1     coluna2              coluna3     coluna4
A   -200.0  -35.593491    43.16845002860258   97.885861
C    -24.0  -38.218990   110.83337637106989 -207.351451
F    118.0  205.920072   -172.5361764516966   42.629369
H    103.0  -27.627483  -110.21002532504967 -158.827858

Dados Duplicados

In [103]:
df_dup = df.append(df.loc['D':'H',:]).sort_index()
df_dup

AttributeError: 'DataFrame' object has no attribute 'append'

In [104]:
df_dup.drop_duplicates()

NameError: name 'df_dup' is not defined

In [105]:
df_dup.drop_duplicates(subset=['coluna1'])

NameError: name 'df_dup' is not defined

Mapeamentos

In [106]:
# 1 feminino, 0 masculino
genero = pd.Series([1,0,1,1,1,1,0,0,0,1,1,0])
genero

0     1
1     0
2     1
3     1
4     1
5     1
6     0
7     0
8     0
9     1
10    1
11    0
dtype: int64

In [107]:
genero.map({1:'Feminino', 0:'Masculino'})

0      Feminino
1     Masculino
2      Feminino
3      Feminino
4      Feminino
5      Feminino
6     Masculino
7     Masculino
8     Masculino
9      Feminino
10     Feminino
11    Masculino
dtype: object

In [108]:
genero_2 = genero.map({1:'Feminino', 0:'Masculino'})

In [109]:
genero.map({1:'Feminino', 2:'Masculino'})

0     Feminino
1          NaN
2     Feminino
3     Feminino
4     Feminino
5     Feminino
6          NaN
7          NaN
8          NaN
9     Feminino
10    Feminino
11         NaN
dtype: object

In [110]:
genero_2.map('Genero: {}'.format)

0      Genero: Feminino
1     Genero: Masculino
2      Genero: Feminino
3      Genero: Feminino
4      Genero: Feminino
5      Genero: Feminino
6     Genero: Masculino
7     Genero: Masculino
8     Genero: Masculino
9      Genero: Feminino
10     Genero: Feminino
11    Genero: Masculino
dtype: object